# =============================================================================
# Brewfile - Complete development environment for macOS (M5 Pro)
# Generated: 2026-04-06
# Usage: brew bundle --file=~/Brewfile
# =============================================================================

# --- Taps -------------------------------------------------------------------
tap "nicoverbruggen/cask"
tap "oven-sh/bun"
tap "stripe/stripe-cli"

# --- CLI Tools ---------------------------------------------------------------
brew "cloudflared"
brew "composer"
brew "dnsmasq", restart_service: :changed
brew "gh"
brew "ghostscript"
brew "git-lfs"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "mailpit", restart_service: :changed
brew "mkcert"
brew "mole"
brew "ncdu"
brew "nginx"
brew "nvm"
brew "pngquant"
brew "pnpm"
brew "redis", restart_service: :changed
brew "tmux"
brew "wget"
brew "worktrunk"
brew "zsh-autosuggestions"

# --- PHP (additional versions & extensions managed via PHP Monitor) ----------
brew "php", restart_service: :changed

# --- CLIs (vendor taps) ------------------------------------------------------
brew "stripe/stripe-cli/stripe"

# --- Cask: Dev Tools ---------------------------------------------------------
cask "1password"
cask "1password-cli"
cask "claude"
cask "codex"
cask "dbngin"
cask "docker"
cask "ghostty"
cask "nicoverbruggen/cask/phpmon"
cask "phpstorm"
cask "tableplus"
cask "tinkerwell"
cask "warp"

# --- Cask: Browsers ----------------------------------------------------------
cask "firefox"
cask "google-chrome"

# --- Cask: Communication -----------------------------------------------------
cask "readdle-spark"
cask "slack"
cask "telegram"
cask "whatsapp"

# --- Cask: Productivity ------------------------------------------------------
cask "linear-linear"
cask "notion-calendar"
cask "obsidian"
cask "raycast"

# --- Cask: Utilities ---------------------------------------------------------
cask "calibre"
cask "cleanshot"
cask "elgato-control-center"
cask "google-drive"
cask "httpie-desktop"
cask "ledger-wallet"
cask "logitune"
cask "nordvpn"
cask "tailscale"
cask "textsniper"
cask "the-unarchiver"
cask "vlc"

# =============================================================================
# Manual installs (not in Homebrew):
#   - Bear (Mac App Store)
#   - Things 3 (Mac App Store)
#   - Xcode (Mac App Store: xcode-select --install for CLI tools)
#   - Beeper Desktop (beeper.com)
# =============================================================================
